package com.github.xu42.china.mobile.number.enums;

/**
 * 中国移动通信运营商 枚举
 */
public enum ChinaMobileOperatorEnum {

    /**
     * 中国移动
     * 1340、1341、1342、1343、1344、1345、1346、1347、1348
     * 135、136、137、138、139
     * 144
     * 上网卡：147
     * 148、150、151、152、157、158、159
     * 虚拟运营商：165、1703、1705、1706
     * 172、178、182、183、184、187、188
     * 195、197、198
     */
    CHINA_MOBILE,

    /**
     * 中国联通
     * 130、131、132
     * 上网卡：145
     * 146、155、156、166
     * 虚拟运营商：167、171、1704、1707、1708、1709
     * 175、176、185、186、196
     */
    CHINA_UNICOM,

    /**
     * 中国电信
     * 133、1349、1410
     * 上网卡：149
     * 153、173
     * 虚拟运营商：162、1700、1701、1702
     * 17400、17401、17402、17403、17405
     * 177、180、181、189
     * 190、191、193、199
     */
    CHINA_TELECOM,

    /**
     * 中国广电
     * 号段: 192
     */
    CHINA_BROADCASTING,

    /**
     * 北京船舶通信导航有限公司/交通运输通信信息集团有限公司
     * 号段: 1749(卫星手机专用号段)
     */
    CHINA_TRANSPORT,

    /**
     * 未知
     */
    UNKNOWN;

}
